OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16c782.h
extern __at(0x009D) volatile __ANSELbits_t ANSELbits;

#define _ANS0                   0x01
#define _ANS1                   0x02
#define _ANS2                   0x04
#define _ANS3                   0x08
#define _ANS4                   0x10
#define _ANS5                   0x20
#define _ANS6                   0x40
#define _ANS7                   0x80

//==============================================================================


//==============================================================================
//        ADCON1 Bits

extern __at(0x009F) __sfr ADCON1;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned VCFG0              : 1;
    unsigned VCFG1              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 4;
    unsigned VCFG               : 2;
    unsigned                    : 2;
    };
  } __ADCON1bits_t;

extern __at(0x009F) volatile __ADCON1bits_t ADCON1bits;

#define _VCFG0                  0x10
#define _VCFG1                  0x20

//==============================================================================

extern __at(0x010C) __sfr PMDATL;
extern __at(0x010D) __sfr PMADRL;
extern __at(0x010E) __sfr PMDATH;
extern __at(0x010F) __sfr PMADRH;

//==============================================================================
//        CALCON Bits

extern __at(0x0110) __sfr CALCON;

typedef struct
  {
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned CALREF               : 1;
  unsigned CALERR               : 1;
  unsigned CAL                  : 1;
  } __CALCONbits_t;

extern __at(0x0110) volatile __CALCONbits_t CALCONbits;

#define _CALREF                 0x20
#define _CALERR                 0x40
#define _CAL                    0x80

//==============================================================================


//==============================================================================
//        PSMCCON0 Bits

extern __at(0x0111) __sfr PSMCCON0;

typedef union
  {
  struct
    {
    unsigned DC0                : 1;
    unsigned DC1                : 1;
    unsigned MAXDC0             : 1;
    unsigned MAXDC1             : 1;
    unsigned MINDC0             : 1;
    unsigned MINDC1             : 1;
    unsigned SMCCL0             : 1;
    unsigned SMCCL1             : 1;
    };

  struct
    {
    unsigned DC                 : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 2;
    unsigned MAXDC              : 2;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned MINDC              : 2;
    unsigned                    : 2;
    };

  struct
    {
    unsigned                    : 6;
    unsigned SMCCL              : 2;
    };
  } __PSMCCON0bits_t;

extern __at(0x0111) volatile __PSMCCON0bits_t PSMCCON0bits;

#define _DC0                    0x01
#define _DC1                    0x02
#define _MAXDC0                 0x04
#define _MAXDC1                 0x08
#define _MINDC0                 0x10
#define _MINDC1                 0x20
#define _SMCCL0                 0x40
#define _SMCCL1                 0x80

//==============================================================================


//==============================================================================
//        PSMCCON1 Bits

extern __at(0x0112) __sfr PSMCCON1;

typedef union
  {
  struct
    {
    unsigned SMCCS              : 1;
    unsigned PWM_NOT_PSM        : 1;
    unsigned SMCOM              : 1;
    unsigned SCEN               : 1;
    unsigned                    : 1;
    unsigned S1BPOL             : 1;
    unsigned S1APOL             : 1;
    unsigned SMCON              : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned PWM                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned PSM                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned NOT_PSM            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __PSMCCON1bits_t;

extern __at(0x0112) volatile __PSMCCON1bits_t PSMCCON1bits;

#define _SMCCS                  0x01
#define _PWM_NOT_PSM            0x02
#define _PWM                    0x02
#define _PSM                    0x02
#define _NOT_PSM                0x02
#define _SMCOM                  0x04
#define _SCEN                   0x08
#define _S1BPOL                 0x20
#define _S1APOL                 0x40
#define _SMCON                  0x80

//==============================================================================


//==============================================================================
//        CM1CON0 Bits

extern __at(0x0119) __sfr CM1CON0;

typedef union
  {
  struct
    {
    unsigned C1CH0              : 1;
    unsigned C1CH1              : 1;
    unsigned C1R                : 1;
    unsigned C1SP               : 1;
    unsigned C1POL              : 1;
    unsigned C1OE               : 1;
    unsigned C1OUT              : 1;
    unsigned C1ON               : 1;
    };

  struct
    {
    unsigned C1CH               : 2;
    unsigned                    : 6;
    };
  } __CM1CON0bits_t;

extern __at(0x0119) volatile __CM1CON0bits_t CM1CON0bits;

#define _C1CH0                  0x01
#define _C1CH1                  0x02
#define _C1R                    0x04
#define _C1SP                   0x08
#define _C1POL                  0x10
#define _C1OE                   0x20
#define _C1OUT                  0x40
#define _C1ON                   0x80

//==============================================================================


//==============================================================================
//        CM2CON0 Bits

extern __at(0x011A) __sfr CM2CON0;

typedef union
  {
  struct
    {
    unsigned C2CH0              : 1;
    unsigned C2CH1              : 1;
    unsigned C2R                : 1;
    unsigned C2SP               : 1;
    unsigned C2POL              : 1;
    unsigned C2OE               : 1;
    unsigned C2OUT              : 1;
    unsigned C2ON               : 1;
    };

  struct
    {
    unsigned C2CH               : 2;
    unsigned                    : 6;
    };
  } __CM2CON0bits_t;

