OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16c782.h
#ifndef NO_BIT_DEFINES

#define ADON                    ADCON0bits.ADON                 // bit 0
#define CHS3                    ADCON0bits.CHS3                 // bit 1
#define GO_NOT_DONE             ADCON0bits.GO_NOT_DONE          // bit 2, shadows bit in ADCON0bits
#define GO                      ADCON0bits.GO                   // bit 2, shadows bit in ADCON0bits
#define NOT_DONE                ADCON0bits.NOT_DONE             // bit 2, shadows bit in ADCON0bits
#define GO_DONE                 ADCON0bits.GO_DONE              // bit 2, shadows bit in ADCON0bits
#define CHS0                    ADCON0bits.CHS0                 // bit 3
#define CHS1                    ADCON0bits.CHS1                 // bit 4
#define CHS2                    ADCON0bits.CHS2                 // bit 5
#define ADCS0                   ADCON0bits.ADCS0                // bit 6
#define ADCS1                   ADCON0bits.ADCS1                // bit 7

#define VCFG0                   ADCON1bits.VCFG0                // bit 4
#define VCFG1                   ADCON1bits.VCFG1                // bit 5

#define ANS0                    ANSELbits.ANS0                  // bit 0
#define ANS1                    ANSELbits.ANS1                  // bit 1
#define ANS2                    ANSELbits.ANS2                  // bit 2
#define ANS3                    ANSELbits.ANS3                  // bit 3
#define ANS4                    ANSELbits.ANS4                  // bit 4
#define ANS5                    ANSELbits.ANS5                  // bit 5
#define ANS6                    ANSELbits.ANS6                  // bit 6
#define ANS7                    ANSELbits.ANS7                  // bit 7

#define CALREF                  CALCONbits.CALREF               // bit 5
#define CALERR                  CALCONbits.CALERR               // bit 6
#define CAL                     CALCONbits.CAL                  // bit 7

#define C1CH0                   CM1CON0bits.C1CH0               // bit 0
#define C1CH1                   CM1CON0bits.C1CH1               // bit 1
#define C1R                     CM1CON0bits.C1R                 // bit 2
#define C1SP                    CM1CON0bits.C1SP                // bit 3
#define C1POL                   CM1CON0bits.C1POL               // bit 4
#define C1OE                    CM1CON0bits.C1OE                // bit 5
#define C1OUT                   CM1CON0bits.C1OUT               // bit 6
#define C1ON                    CM1CON0bits.C1ON                // bit 7

#define C2CH0                   CM2CON0bits.C2CH0               // bit 0
#define C2CH1                   CM2CON0bits.C2CH1               // bit 1
#define C2R                     CM2CON0bits.C2R                 // bit 2
#define C2SP                    CM2CON0bits.C2SP                // bit 3
#define C2POL                   CM2CON0bits.C2POL               // bit 4
#define C2OE                    CM2CON0bits.C2OE                // bit 5
#define C2OUT                   CM2CON0bits.C2OUT               // bit 6
#define C2ON                    CM2CON0bits.C2ON                // bit 7

#define C2SYNC                  CM2CON1bits.C2SYNC              // bit 0
#define MC2OUT                  CM2CON1bits.MC2OUT              // bit 6
#define MC1OUT                  CM2CON1bits.MC1OUT              // bit 7

#define DA0                     DACbits.DA0                     // bit 0
#define DA1                     DACbits.DA1                     // bit 1
#define DA2                     DACbits.DA2                     // bit 2
#define DA3                     DACbits.DA3                     // bit 3
#define DA4                     DACbits.DA4                     // bit 4
#define DA5                     DACbits.DA5                     // bit 5
#define DA6                     DACbits.DA6                     // bit 6
#define DA7                     DACbits.DA7                     // bit 7

#define DARS0                   DACON0bits.DARS0                // bit 0
#define DARS1                   DACON0bits.DARS1                // bit 1
#define DAOE                    DACON0bits.DAOE                 // bit 6
#define DAON                    DACON0bits.DAON                 // bit 7

#define RBIF                    INTCONbits.RBIF                 // bit 0
#define INTF                    INTCONbits.INTF                 // bit 1
#define T0IF                    INTCONbits.T0IF                 // bit 2
#define RBIE                    INTCONbits.RBIE                 // bit 3
#define INTE                    INTCONbits.INTE                 // bit 4
#define T0IE                    INTCONbits.T0IE                 // bit 5
#define PEIE                    INTCONbits.PEIE                 // bit 6
#define GIE                     INTCONbits.GIE                  // bit 7

#define IOCB0                   IOCBbits.IOCB0                  // bit 0
#define IOCB1                   IOCBbits.IOCB1                  // bit 1
#define IOCB2                   IOCBbits.IOCB2                  // bit 2
#define IOCB3                   IOCBbits.IOCB3                  // bit 3
#define IOCB4                   IOCBbits.IOCB4                  // bit 4
#define IOCB5                   IOCBbits.IOCB5                  // bit 5
#define IOCB6                   IOCBbits.IOCB6                  // bit 6
#define IOCB7                   IOCBbits.IOCB7                  // bit 7

#define LV0                     LVDCONbits.LV0                  // bit 0
#define LV1                     LVDCONbits.LV1                  // bit 1
#define LV2                     LVDCONbits.LV2                  // bit 2
#define LV3                     LVDCONbits.LV3                  // bit 3
#define LVDEN                   LVDCONbits.LVDEN                // bit 4
#define BGST                    LVDCONbits.BGST                 // bit 5

#define GBWP                    OPACONbits.GBWP                 // bit 0
#define CMPEN                   OPACONbits.CMPEN                // bit 6
#define OPAON                   OPACONbits.OPAON                // bit 7

#define PS0                     OPTION_REGbits.PS0              // bit 0
#define PS1                     OPTION_REGbits.PS1              // bit 1
#define PS2                     OPTION_REGbits.PS2              // bit 2
#define PSA                     OPTION_REGbits.PSA              // bit 3
#define T0SE                    OPTION_REGbits.T0SE             // bit 4
#define T0CS                    OPTION_REGbits.T0CS             // bit 5
#define INTEDG                  OPTION_REGbits.INTEDG           // bit 6
#define NOT_RBPU                OPTION_REGbits.NOT_RBPU         // bit 7

#define NOT_BOR                 PCONbits.NOT_BOR                // bit 0, shadows bit in PCONbits
#define NOT_BO                  PCONbits.NOT_BO                 // bit 0, shadows bit in PCONbits
#define NOT_POR                 PCONbits.NOT_POR                // bit 1
#define OSCF                    PCONbits.OSCF                   // bit 3
#define WDTON                   PCONbits.WDTON                  // bit 4

#define TMR1IE                  PIE1bits.TMR1IE                 // bit 0
#define C1IE                    PIE1bits.C1IE                   // bit 4
#define C2IE                    PIE1bits.C2IE                   // bit 5
#define ADIE                    PIE1bits.ADIE                   // bit 6
#define LVDIE                   PIE1bits.LVDIE                  // bit 7

#define TMR1IF                  PIR1bits.TMR1IF                 // bit 0
#define C1IF                    PIR1bits.C1IF                   // bit 4
#define C2IF                    PIR1bits.C2IF                   // bit 5
#define ADIF                    PIR1bits.ADIF                   // bit 6
#define LVDIF                   PIR1bits.LVDIF                  // bit 7

#define RD                      PMCON1bits.RD                   // bit 0

