OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16c782.h
#define RA0                     PORTAbits.RA0                   // bit 0
#define RA1                     PORTAbits.RA1                   // bit 1
#define RA2                     PORTAbits.RA2                   // bit 2
#define RA3                     PORTAbits.RA3                   // bit 3
#define RA4                     PORTAbits.RA4                   // bit 4
#define RA5                     PORTAbits.RA5                   // bit 5
#define RA6                     PORTAbits.RA6                   // bit 6
#define RA7                     PORTAbits.RA7                   // bit 7

#define RB0                     PORTBbits.RB0                   // bit 0
#define RB1                     PORTBbits.RB1                   // bit 1
#define RB2                     PORTBbits.RB2                   // bit 2
#define RB3                     PORTBbits.RB3                   // bit 3
#define RB4                     PORTBbits.RB4                   // bit 4
#define RB5                     PORTBbits.RB5                   // bit 5
#define RB6                     PORTBbits.RB6                   // bit 6
#define RB7                     PORTBbits.RB7                   // bit 7

#define DC0                     PSMCCON0bits.DC0                // bit 0
#define DC1                     PSMCCON0bits.DC1                // bit 1
#define MAXDC0                  PSMCCON0bits.MAXDC0             // bit 2
#define MAXDC1                  PSMCCON0bits.MAXDC1             // bit 3
#define MINDC0                  PSMCCON0bits.MINDC0             // bit 4
#define MINDC1                  PSMCCON0bits.MINDC1             // bit 5
#define SMCCL0                  PSMCCON0bits.SMCCL0             // bit 6
#define SMCCL1                  PSMCCON0bits.SMCCL1             // bit 7

#define SMCCS                   PSMCCON1bits.SMCCS              // bit 0
#define PWM_NOT_PSM             PSMCCON1bits.PWM_NOT_PSM        // bit 1, shadows bit in PSMCCON1bits
#define PWM                     PSMCCON1bits.PWM                // bit 1, shadows bit in PSMCCON1bits
#define PSM                     PSMCCON1bits.PSM                // bit 1, shadows bit in PSMCCON1bits
#define NOT_PSM                 PSMCCON1bits.NOT_PSM            // bit 1, shadows bit in PSMCCON1bits
#define SMCOM                   PSMCCON1bits.SMCOM              // bit 2
#define SCEN                    PSMCCON1bits.SCEN               // bit 3
#define S1BPOL                  PSMCCON1bits.S1BPOL             // bit 5
#define S1APOL                  PSMCCON1bits.S1APOL             // bit 6
#define SMCON                   PSMCCON1bits.SMCON              // bit 7

#define VROE                    REFCONbits.VROE                 // bit 2, shadows bit in REFCONbits
#define VREFOE                  REFCONbits.VREFOE               // bit 2, shadows bit in REFCONbits
#define VREN                    REFCONbits.VREN                 // bit 3, shadows bit in REFCONbits
#define VREFEN                  REFCONbits.VREFEN               // bit 3, shadows bit in REFCONbits

#define C                       STATUSbits.C                    // bit 0
#define DC                      STATUSbits.DC                   // bit 1
#define Z                       STATUSbits.Z                    // bit 2
#define NOT_PD                  STATUSbits.NOT_PD               // bit 3
#define NOT_TO                  STATUSbits.NOT_TO               // bit 4
#define RP0                     STATUSbits.RP0                  // bit 5
#define RP1                     STATUSbits.RP1                  // bit 6
#define IRP                     STATUSbits.IRP                  // bit 7

#define TMR1ON                  T1CONbits.TMR1ON                // bit 0
#define TMR1CS                  T1CONbits.TMR1CS                // bit 1
#define NOT_T1SYNC              T1CONbits.NOT_T1SYNC            // bit 2, shadows bit in T1CONbits
#define T1INSYNC                T1CONbits.T1INSYNC              // bit 2, shadows bit in T1CONbits
#define T1OSCEN                 T1CONbits.T1OSCEN               // bit 3
#define T1CKPS0                 T1CONbits.T1CKPS0               // bit 4
#define T1CKPS1                 T1CONbits.T1CKPS1               // bit 5
#define TMR1GE                  T1CONbits.TMR1GE                // bit 6

#define TRISA0                  TRISAbits.TRISA0                // bit 0
#define TRISA1                  TRISAbits.TRISA1                // bit 1
#define TRISA2                  TRISAbits.TRISA2                // bit 2
#define TRISA3                  TRISAbits.TRISA3                // bit 3
#define TRISA4                  TRISAbits.TRISA4                // bit 4
#define TRISA5                  TRISAbits.TRISA5                // bit 5
#define TRISA6                  TRISAbits.TRISA6                // bit 6
#define TRISA7                  TRISAbits.TRISA7                // bit 7

#define TRISB0                  TRISBbits.TRISB0                // bit 0
#define TRISB1                  TRISBbits.TRISB1                // bit 1
#define TRISB2                  TRISBbits.TRISB2                // bit 2
#define TRISB3                  TRISBbits.TRISB3                // bit 3
#define TRISB4                  TRISBbits.TRISB4                // bit 4
#define TRISB5                  TRISBbits.TRISB5                // bit 5
#define TRISB6                  TRISBbits.TRISB6                // bit 6
#define TRISB7                  TRISBbits.TRISB7                // bit 7

#define WPUB0                   WPUBbits.WPUB0                  // bit 0
#define WPUB1                   WPUBbits.WPUB1                  // bit 1
#define WPUB2                   WPUBbits.WPUB2                  // bit 2
#define WPUB3                   WPUBbits.WPUB3                  // bit 3
#define WPUB4                   WPUBbits.WPUB4                  // bit 4
#define WPUB5                   WPUBbits.WPUB5                  // bit 5
#define WPUB6                   WPUBbits.WPUB6                  // bit 6
#define WPUB7                   WPUBbits.WPUB7                  // bit 7

#endif // #ifndef NO_BIT_DEFINES

#endif // #ifndef __PIC16C782_H__
